Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup ethernet_mac_stm32msp432e4xx_defines MAC MSP432E4xx Defines
 *
 * @brief <b>Defined Constants and Types for the Ethernet MAC for MSP432E4xx
 * chips</b>
 *
 * @ingroup ETH
 *
 * @version 1.0.0
 *
 * @author @htmlonly &copy; @endhtmlonly 2013 Frantisek Burian <BuFran@seznam.cz>
 *
 * @date 1 September 2013
 *
 * LGPL License Terms @ref lgpl_license
 */
/*
 * This file is part of the libopencm3 project.
 *
 * Copyright (C) 2013 Frantisek Burian <BuFran@seznam.cz>
 *
 * This library is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this library.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifndef LIBOPENCM3_ETHERNET_H
#define LIBOPENCM3_ETHERNET_H

/**@{*/

#include <libopencm3/msp432/e4/memorymap.h>
#include <libopencm3/cm3/common.h>

/** @defgroup ethernet_registers Ethernet Registers
 * @ingroup ethernet_defines
 * @brief Ethernet Controller Registers
@{*/
/** Ethernet MAC Configuration */
#define EMAC_EMACCFG                MMIO32(EMAC_BASE + 0x0)
/** Ethernet MAC Frame Filter */
#define EMAC_EMACFRAMEFLTR          MMIO32(EMAC_BASE + 0x4)
/** Ethernet MAC Hash Table High */
#define EMAC_EMACHASHTBLH           MMIO32(EMAC_BASE + 0x8)
/** Ethernet MAC Hash Table Low */
#define EMAC_EMACHASHTBLL           MMIO32(EMAC_BASE + 0xC)
/** Ethernet MAC MII Address */
#define EMAC_EMACMIIADDR            MMIO32(EMAC_BASE + 0x10)
/** Ethernet MAC MII Data Register */
#define EMAC_EMACMIIDATA            MMIO32(EMAC_BASE + 0x14)
/** Ethernet MAC Flow Control */
#define EMAC_EMACFLOWCTL            MMIO32(EMAC_BASE + 0x18)
/** Ethernet MAC VLAN Tag */
#define EMAC_EMACVLANTG             MMIO32(EMAC_BASE + 0x1C)
/** Ethernet MAC Status */
#define EMAC_EMACSTATUS             MMIO32(EMAC_BASE + 0x24)
/** Ethernet MAC Remote Wake-Up Frame Filter */
#define EMAC_EMACRWUFF              MMIO32(EMAC_BASE + 0x28)
/** Ethernet MAC PMT Control and Status Register */
#define EMAC_EMACPMTCTLSTAT         MMIO32(EMAC_BASE + 0x2C)
/** LPI Control and Status */
#define EMAC_EMACLPICTLSTAT         MMIO32(EMAC_BASE + 0x30)
/** LPI Timers Control */
#define EMAC_EMACLPITIMERCTL        MMIO32(EMAC_BASE + 0x34)
/** Ethernet MAC Raw Interrupt Status */
#define EMAC_EMACRIS                MMIO32(EMAC_BASE + 0x38)
/** Ethernet MAC Interrupt Mask */
#define EMAC_EMACCIM                MMIO32(EMAC_BASE + 0x3C)
/** Ethernet MAC Address 0 High */
#define EMAC_EMACADDR0H             MMIO32(EMAC_BASE + 0x40)
/** Ethernet MAC Address 0 Low */
#define EMAC_EMACADDR0L             MMIO32(EMAC_BASE + 0x44)
/** Ethernet MAC Address 1 High */
#define EMAC_EMACADDR1H             MMIO32(EMAC_BASE + 0x48)
/** Ethernet MAC Address 1 Low */
#define EMAC_EMACADDR1L             MMIO32(EMAC_BASE + 0x4C)
/** Ethernet MAC Address 2 High */
#define EMAC_EMACADDR2H             MMIO32(EMAC_BASE + 0x50)
/** Ethernet MAC Address 2 Low */
#define EMAC_EMACADDR2L             MMIO32(EMAC_BASE + 0x54)
/** Ethernet MAC Address 3 High */
#define EMAC_EMACADDR3H             MMIO32(EMAC_BASE + 0x58)
/** Ethernet MAC Address 3 Low */
#define EMAC_EMACADDR3L             MMIO32(EMAC_BASE + 0x5C)
/** Ethernet MAC Watchdog Time-out */
#define EMAC_EMACWDOGTO             MMIO32(EMAC_BASE + 0xDC)
/** Ethernet MAC MMC Control */
#define EMAC_EMACMMCCTRL            MMIO32(EMAC_BASE + 0x100)
/** Ethernet MAC MMC Receive Raw Interrupt Status */
#define EMAC_EMACMMCRXRIS           MMIO32(EMAC_BASE + 0x104)
/** Ethernet MAC MMC Transmit Raw Interrupt Status */
#define EMAC_EMACMMCTXRIS           MMIO32(EMAC_BASE + 0x108)
/** Ethernet MAC MMC Receive Interrupt Mask */
#define EMAC_EMACMMCRXIM            MMIO32(EMAC_BASE + 0x10C)
/** Ethernet MAC MMC Transmit Interrupt Mask */
#define EMAC_EMACMMCTXIM            MMIO32(EMAC_BASE + 0x110)
/** Ethernet MAC Transmit Frame Count for Good and Bad Frames */
#define EMAC_EMACTXCNTGB            MMIO32(EMAC_BASE + 0x118)
/** Ethernet MAC Transmit Frame Count
 *  for Frames Transmitted after Single Collision */
#define EMAC_EMACTXCNTSCOL          MMIO32(EMAC_BASE + 0x14C)
/** Ethernet MAC Transmit Frame Count
 *  for Frames Transmitted after Multiple Collisions */
#define EMAC_EMACTXCNTMCOL          MMIO32(EMAC_BASE + 0x150)
/** Ethernet MAC Transmit Octet Count Good */
#define EMAC_EMACTXOCTCNTG          MMIO32(EMAC_BASE + 0x164)
/** Ethernet MAC Receive Frame Count for Good and Bad Frames */
#define EMAC_EMACRXCNTGB            MMIO32(EMAC_BASE + 0x180)
/** Ethernet MAC Receive Frame Count for CRC Error Frames */
#define EMAC_EMACRXCNTCRCERR        MMIO32(EMAC_BASE + 0x194)
/** Ethernet MAC Receive Frame Count for Alignment Error Frames */
#define EMAC_EMACRXCNTALGNERR       MMIO32(EMAC_BASE + 0x198)
/** Ethernet MAC Receive Frame Count for Good Unicast Frames */
#define EMAC_EMACRXCNTGUNI          MMIO32(EMAC_BASE + 0x1C4)
/** Ethernet MAC VLAN Tag Inclusion or Replacement */
#define EMAC_EMACVLNINCREP          MMIO32(EMAC_BASE + 0x584)
/** Ethernet MAC VLAN Hash Table */
#define EMAC_EMACVLANHASH           MMIO32(EMAC_BASE + 0x588)
/** Ethernet MAC Timestamp Control */
#define EMAC_EMACTIMSTCTRL          MMIO32(EMAC_BASE + 0x700)
/** Ethernet MAC Sub-Second Increment */
#define EMAC_EMACSUBSECINC          MMIO32(EMAC_BASE + 0x704)
/** Ethernet MAC System Time - Seconds */
#define EMAC_EMACTIMSEC             MMIO32(EMAC_BASE + 0x708)
/** Ethernet MAC System Time - Nanoseconds */
#define EMAC_EMACTIMNANO            MMIO32(EMAC_BASE + 0x70C)
/** Ethernet MAC System Time - Seconds Update */
#define EMAC_EMACTIMSECU            MMIO32(EMAC_BASE + 0x710)
/** Ethernet MAC System Time - Nanoseconds Update */
#define EMAC_EMACTIMNANOU           MMIO32(EMAC_BASE + 0x714)
/** Ethernet MAC Timestamp Addend */
#define EMAC_EMACTIMADD             MMIO32(EMAC_BASE + 0x718)
/** Ethernet MAC Target Time Seconds */
#define EMAC_EMACTARGSEC            MMIO32(EMAC_BASE + 0x71C)
/** Ethernet MAC Target Time Nanoseconds */
#define EMAC_EMACTARGNANO           MMIO32(EMAC_BASE + 0x720)
/** Ethernet MAC System Time-Higher Word Seconds */
#define EMAC_EMACHWORDSEC           MMIO32(EMAC_BASE + 0x724)
/** Ethernet MAC Timestamp Status */
#define EMAC_EMACTIMSTAT            MMIO32(EMAC_BASE + 0x728)
/** Ethernet MAC PPS Control */
#define EMAC_EMACPPSCTRL            MMIO32(EMAC_BASE + 0x72C)
/** Ethernet MAC PPS0 Interval */
#define EMAC_EMACPPS0INTVL          MMIO32(EMAC_BASE + 0x760)
/** Ethernet MAC PPS0 Width */
#define EMAC_EMACPPS0WIDTH          MMIO32(EMAC_BASE + 0x764)
/** Ethernet MAC DMA Bus Mode */
#define EMAC_EMACDMABUSMOD          MMIO32(EMAC_BASE + 0xC00)
/** Ethernet MAC Transmit Poll Demand */
#define EMAC_EMACTXPOLLD            MMIO32(EMAC_BASE + 0xC04)
/** Ethernet MAC Receive Poll Demand */
#define EMAC_EMACRXPOLLD            MMIO32(EMAC_BASE + 0xC08)
/** Ethernet MAC Receive Descriptor List Address */
#define EMAC_EMACRXDLADDR           MMIO32(EMAC_BASE + 0xC0C)
/** Ethernet MAC Transmit Descriptor List Address */
#define EMAC_EMACTXDLADDR           MMIO32(EMAC_BASE + 0xC10)
/** Ethernet MAC DMA Interrupt Status */
#define EMAC_EMACDMARIS             MMIO32(EMAC_BASE + 0xC14)
/** Ethernet MAC DMA Operation Mode */
#define EMAC_EMACDMAOPMODE          MMIO32(EMAC_BASE + 0xC18)
/** Ethernet MAC DMA Interrupt Mask Register */
#define EMAC_EMACDMAIM              MMIO32(EMAC_BASE + 0xC1C)
/** Ethernet MAC Missed Frame and Buffer Overflow Counter */
#define EMAC_EMACMFBOC              MMIO32(EMAC_BASE + 0xC20)
/** Ethernet MAC Receive Interrupt Watchdog Timer */
#define EMAC_EMACRXINTWDT           MMIO32(EMAC_BASE + 0xC24)
/** Ethernet MAC Current Host Transmit Descriptor */
#define EMAC_EMACHOSTXDESC          MMIO32(EMAC_BASE + 0xC48)
/** Ethernet MAC Current Host Receive Descriptor */
#define EMAC_EMACHOSRXDESC          MMIO32(EMAC_BASE + 0xC4C)
/** Ethernet MAC Current Host Transmit Buffer Address */
#define EMAC_EMACHOSTXBA            MMIO32(EMAC_BASE + 0xC50)
/** Ethernet MAC Current Host Receive Buffer Address */
#define EMAC_EMACHOSRXBA            MMIO32(EMAC_BASE + 0xC54)
/** Ethernet MAC Peripheral Property Register */
#define EMAC_EMACPP                 MMIO32(EMAC_BASE + 0xFC0)
/** Ethernet MAC Peripheral Configuration Register */
#define EMAC_EMACPC                 MMIO32(EMAC_BASE + 0xFC4)
/** Ethernet MAC Clock Configuration Register */
#define EMAC_EMACCC                 MMIO32(EMAC_BASE + 0xFC8)
/** Ethernet PHY Raw Interrupt Status */
#define EMAC_EPHYRIS                MMIO32(EMAC_BASE + 0xFD0)
/** Ethernet PHY Interrupt Mask */
#define EMAC_EPHYIM                 MMIO32(EMAC_BASE + 0xFD4)
/** Ethernet PHY Masked Interrupt Status and Clear */
#define EMAC_EPHYMISC               MMIO32(EMAC_BASE + 0xFD8)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emaccfg_values EMAC_EMACCFG Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Configuration Register Values
@{*/
/** Source Address Insertion or Replacement Control Shift */
#define EMAC_EMACCFG_SADDR_SHIFT    (28)
/** Source Address Insertion or Replacement Control */
#define EMAC_EMACCFG_SADDR          (0x7 << EMAC_EMACCFG_SADDR_SHIFT)
/** IEEE 802.3as Support for 2K Packets */
#define EMAC_EMACCFG_TWOKPEN        (1 << 27)
/** CRC Stripping for Type Frames */
#define EMAC_EMACCFG_CST            (1 << 25)
/** Watchdog Disable */
#define EMAC_EMACCFG_WDDIS          (1 << 23)
/** Jabber Disable */
#define EMAC_EMACCFG_JD             (1 << 22)
/** Jumbo Frame Enable */
#define EMAC_EMACCFG_JFEN           (1 << 20)
/** Inter-Frame Gap Shift */
#define EMAC_EMACCFG_IFG_SHIFT      (17)
/** Inter-Frame Gap */
#define EMAC_EMACCFG_IFG            (0x7 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 96 bit */
#define EMAC_EMACCFG_IFG_96         (0x0 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 88 bit */
#define EMAC_EMACCFG_IFG_88         (0x1 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 80 bit */
#define EMAC_EMACCFG_IFG_80         (0x2 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 72 bit */
#define EMAC_EMACCFG_IFG_72         (0x3 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 64 bit */
#define EMAC_EMACCFG_IFG_64         (0x4 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 56 bit */
#define EMAC_EMACCFG_IFG_56         (0x5 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 48 bit */
#define EMAC_EMACCFG_IFG_48         (0x6 << EMAC_EMACCFG_IFG_SHIFT)
/** Inter-Frame Gap - 40 bit */
#define EMAC_EMACCFG_IFG_40         (0x7 << EMAC_EMACCFG_IFG_SHIFT)
/** Disable Carrier Sense During Transmission */
#define EMAC_EMACCFG_DISCRS         (1 << 16)
/** Port Select */
#define EMAC_EMACCFG_PS             (1 << 15)
/** Speed */
#define EMAC_EMACCFG_FES            (1 << 14)
/** Disable Receive Own */
#define EMAC_EMACCFG_DRO            (1 << 13)
/** Loopback Mode */
#define EMAC_EMACCFG_LOOPBM         (1 << 12)
/** Duplex Mode */
#define EMAC_EMACCFG_DUPM           (1 << 11)
/** Checksum Offload */
#define EMAC_EMACCFG_IPC            (1 << 10)
/** Disable Retry */
#define EMAC_EMACCFG_DR             (1 << 9)
/** Automatic Pad or CRC Stripping */
#define EMAC_EMACCFG_ACS            (1 << 7)
/** Back-Off Limit Shift */
#define EMAC_EMACCFG_BL_SHIFT       (5)
/** Back-Off Limit */
#define EMAC_EMACCFG_BL             (0x3 << EMAC_EMACCFG_BL_SHIFT)
/** Back-Off Limit: k = min(n, 10) */
#define EMAC_EMACCFG_BL_N_10        (0x0 << EMAC_EMACCFG_BL_SHIFT)
/** Back-Off Limit: k = min(n, 8) */
#define EMAC_EMACCFG_BL_N_8         (0x1 << EMAC_EMACCFG_BL_SHIFT)
/** Back-Off Limit: k = min(n, 4) */
#define EMAC_EMACCFG_BL_N_4         (0x2 << EMAC_EMACCFG_BL_SHIFT)
/** Back-Off Limit: k = min(n, 1) */
#define EMAC_EMACCFG_BL_N_1         (0x3 << EMAC_EMACCFG_BL_SHIFT)
/** Deferral Check */
#define EMAC_EMACCFG_DC             (1 << 4)
/** Transmitter Enable */
#define EMAC_EMACCFG_TE             (1 << 3)
/** Receiver Enable */
#define EMAC_EMACCFG_RE             (1 << 2)
/** Preamble Length for Transmit Frames */
#define EMAC_EMACCFG_PRELEN         (0x3)
/** Preamble Length for Transmit Frames - 7 bytes */
#define EMAC_EMACCFG_PRELEN_7       (0x0)
/** Preamble Length for Transmit Frames - 5 bytes */
#define EMAC_EMACCFG_PRELEN_5       (0x1)
/** Preamble Length for Transmit Frames - 3 bytes */
#define EMAC_EMACCFG_PRELEN_3       (0x2)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacframefltr_values EMAC_EMACFRAMEFLTR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Frame Filter Register Values
@{*/
/** Receive All */
#define EMAC_EMACFRAMEFLTR_RA           (1 << 31)
/** VLAN Tag Filter Enable */
#define EMAC_EMACFRAMEFLTR_VTFE         (1 << 16)
/** Hash or Perfect Filter */
#define EMAC_EMACFRAMEFLTR_HPF          (1 << 10)
/** Source Address Filter Enable */
#define EMAC_EMACFRAMEFLTR_SAF          (1 << 9)
/** Source Address (SA) Inverse Filtering */
#define EMAC_EMACFRAMEFLTR_SAIF         (1 << 8)
/** Pass Control Frames Shift */
#define EMAC_EMACFRAMEFLTR_PCF_SHIFT    (6)
/** Pass Control Frames */
#define EMAC_EMACFRAMEFLTR_PCF          (0x3 << EMAC_EMACFRAMEFLTR_PCF_SHIFT)
/** Disable Broadcast Frames */
#define EMAC_EMACFRAMEFLTR_DBF          (1 << 5)
/** Pass All Multicast */
#define EMAC_EMACFRAMEFLTR_PM           (1 << 4)
/** Destination Address (DA) Inverse Filtering */
#define EMAC_EMACFRAMEFLTR_DAIF         (1 << 3)
/** Hash Multicast */
#define EMAC_EMACFRAMEFLTR_HMC          (1 << 2)
/** Hash Unicast */
#define EMAC_EMACFRAMEFLTR_HUC          (1 << 1)
/** Promiscuous Mode */
#define EMAC_EMACFRAMEFLTR_PR           (1 << 0)
/**@}*/

/** @defgroup emac_emachashtblh_values EMAC_EMACHASHTBLH Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Hash Table High Register Values
@{*/
/** Hash Table High */
#define EMAC_EMACHASHTBLH_HTH           (0xFFFFFFFF)
/**@}*/

