Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup emac_emachashtbll_values EMAC_EMACHASHTBLL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Hash Table Low Register Values
@{*/
/** Hash Table Low */
#define EMAC_EMACHASHTBLL_HTL           (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacmiiaddr_values EMAC_EMACMIIADDR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MII Address Register Values
@{*/
/** Physical Layer Address Shift */
#define EMAC_EMACMIIADDR_PLA_SHIFT  (11)
/** Physical Layer Address Mask */
#define EMAC_EMACMIIADDR_PLA_MASK   (0x1F)
/** Physical Layer Address */
#define EMAC_EMACMIIADDR_PLA(x)     (x << EMAC_EMACMIIADDR_PLA_SHIFT)
/** MII Register Shift */
#define EMAC_EMACMIIADDR_MII_SHIFT  (6)
/** MII Register Mask */
#define EMAC_EMACMIIADDR_MII_MASK   (0x1F)
/** MII Register */
#define EMAC_EMACMIIADDR_MII(x)     (x << EMAC_EMACMIIADDR_MII_SHIFT)
/** Clock Reference Frequency Selection Shift */
#define EMAC_EMACMIIADDR_CR_SHIFT   (2)
/** Clock Reference Frequency Selection Mask */
#define EMAC_EMACMIIADDR_CR                 (0xF << EMAC_EMACMIIADDR_CR_SHIFT)
/** Clock Reference Frequency Selection - SYSCLK/42 */
#define EMAC_EMACMIIADDR_CR_SYSCLK_DIV_42   (0x0 << EMAC_EMACMIIADDR_CR_SHIFT)
/** Clock Reference Frequency Selection - SYSCLK/62 */
#define EMAC_EMACMIIADDR_CR_SYSCLK_DIV_62   (0x1 << EMAC_EMACMIIADDR_CR_SHIFT)
/** Clock Reference Frequency Selection - SYSCLK/16 */
#define EMAC_EMACMIIADDR_CR_SYSCLK_DIV_16   (0x2 << EMAC_EMACMIIADDR_CR_SHIFT)
/** Clock Reference Frequency Selection - SYSCLK/26 */
#define EMAC_EMACMIIADDR_CR_SYSCLK_DIV_26   (0x3 << EMAC_EMACMIIADDR_CR_SHIFT)
/** MII Write */
#define EMAC_EMACMIIADDR_MIIW       (1 << 1)
/** MII Busy */
#define EMAC_EMACMIIADDR_MIIB       (1 << 0)
/**@}*/

/** @defgroup emac_emacmiidata_values EMAC_EMACMIIDATA Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MII Data Register Values
@{*/
/** Ethernet MAC MII Data Mask */
#define EMAC_EMACMIIDATA_DATA_MASK   (0xFFFF)
/** Ethernet MAC MII Data */
#define EMAC_EMACMIIDATA_DATA(x)     (x)
/**@}*/

/** @defgroup emac_emacflowctl_values EMAC_EMACFLOWCTL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Flow Control Register Values
@{*/
/** Pause Time Shift */
#define EMAC_EMACFLOWCTL_PT_SHIFT   (16)
/** Pause Time Mask */
#define EMAC_EMACFLOWCTL_PT_MASK    (0xFFFF)
/** Pause Time */
#define EMAC_EMACFLOWCTL_PT(x)      (x << EMAC_EMACFLOWCTL_PT_SHIFT)
/** Disable Zero-Quanta Pause */
#define EMAC_EMACFLOWCTL_DZQP       (1 << 7)
/** Unicast Pause Frame Detect. */
#define EMAC_EMACFLOWCTL_UP         (1 << 3)
/** Receive Flow Control Enable */
#define EMAC_EMACFLOWCTL_RFE        (1 << 2)
/** Transmit Flow Control Enable */
#define EMAC_EMACFLOWCTL_TFE        (1 << 1)
/** Flow Control Busy or Back-pressure Activate */
#define EMAC_EMACFLOWCTL_FCBBPA     (1 << 0)
/**@}*/

/** @defgroup emac_emacvlantg_values EMAC_EMACVLANTG Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC VLAN Tag Register Values
@{*/
/** VLAN Tag Hash Table Match Enable */
#define EMAC_EMACVLANTG_VTHM        (1 << 19)
/** Enable S-VLAN */
#define EMAC_EMACVLANTG_ESVL        (1 << 18)
/** VLAN Tag Inverse Match Enable */
#define EMAC_EMACVLANTG_VTIM        (1 << 17)
/** Enable 12-Bit VLAN Tag Comparison */
#define EMAC_EMACVLANTG_ETV         (1 << 16)
/** VLAN Tag Identifier for Receive Frames Mask */
#define EMAC_EMACVLANTG_VL_MASK     (0xFFFF)
/** VLAN Tag Identifier for Receive Frames */
#define EMAC_EMACVLANTG_VL(x)       (x)
/**@}*/

/** @defgroup emac_emacstatus_values EMAC_EMACSTATUS Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Status Register Values
@{*/
/** TX/RX Controller TX FIFO Full Status */
#define EMAC_EMACSTATUS_TXFF        (1 << 25)
/** TX/RX Controller TX FIFO Not Empty Status */
#define EMAC_EMACSTATUS_TXFE        (1 << 24)
/** TX/RX Controller TX FIFO Write Controller Active Status */
#define EMAC_EMACSTATUS_TWC         (1 << 22)
/** TX/RX Controller's TX FIFO Read Controller Status Shift */
#define EMAC_EMACSTATUS_TRC_SHIFT   (20)
/** TX/RX Controller's TX FIFO Read Controller Status */
#define EMAC_EMACSTATUS_TRC         (0x3 << EMAC_EMACSTATUS_TRC_SHIFT)
/** TX/RX Controller's TX FIFO Read Controller Status - IDLE State*/
#define EMAC_EMACSTATUS_TRC_IDLE    (0x0)
/** TX/RX Controller's TX FIFO Read Controller Status - Read State*/
#define EMAC_EMACSTATUS_TRC_READ    (0x1)
/** TX/RX Controller's TX FIFO Read Controller Status - Waiting for TX Status from MAC transmitter */
#define EMAC_EMACSTATUS_TRC_WAIT_TX (0x2)
/** TX/RX Controller's TX FIFO Read Controller Status - Writing the received TX Status or flushing the TX FIFO*/
#define EMAC_EMACSTATUS_TRC_WRITE_TX_OR_FLUSH_FIFO  (EMAC_EMACSTATUS_TRC)
/** MAC Transmitter PAUSE */
#define EMAC_EMACSTATUS_TXPAUSED    (1 << 19)
/** MAC Transmit Frame Controller Status Shift */
#define EMAC_EMACSTATUS_TFC_SHIFT   (17)
/** MAC Transmit Frame Controller Status */
#define EMAC_EMACSTATUS_TFC         (0x3 << EMAC_EMACSTATUS_TFC_SHIFT)
/** MAC Transmit Frame Controller Status - IDLE State */
#define EMAC_EMACSTATUS_TFC_IDLE    (0x0 << EMAC_EMACSTATUS_TFC_SHIFT)
/** MAC Transmit Frame Controller Status - Waiting for status of previous frame or IFG or backoff period to
be over*/
#define EMAC_EMACSTATUS_TFC_WAIT_PREV_OR_IFG_OR_BACKOFF   (0x1 << EMAC_EMACSTATUS_TFC_SHIFT)
/** MAC Transmit Frame Controller Status - Generating and transmitting a PAUSE control frame (in the
full-duplex mode) */
#define EMAC_EMACSTATUS_TFC_PAUSE   (0x2 << EMAC_EMACSTATUS_TFC_SHIFT)
/** MAC Transmit Frame Controller Status - Transferring input frame for transmission */
#define EMAC_EMACSTATUS_TFC_TRANSFER_INPUT_FRAME          (EMAC_EMACSTATUS_TFC)
/** MAC MII Transmit Protocol Engine Status */
#define EMAC_EMACSTATUS_TPE         (1 << 16)
/** TX/RX Controller RX FIFO Fill-level Status Shift */
#define EMAC_EMACSTATUS_RXF_SHIFT   (8)
/** TX/RX Controller RX FIFO Fill-level Status */
#define EMAC_EMACSTATUS_RXF         (0x3 << EMAC_EMACSTATUS_RXF_SHIFT)
/** TX/RX Controller RX FIFO Fill-level Status - RX FIFO Empty */
#define EMAC_EMACSTATUS_RXF_FIFO_EMPTY              (0x0 << EMAC_EMACSTATUS_RXF_SHIFT)
/** TX/RX Controller RX FIFO Fill-level Status - RX FIFO fill level is below the flow-control deactivate threshold */
#define EMAC_EMACSTATUS_RXF_FIFO_BELOW_THRESHOLD    (0x1 << EMAC_EMACSTATUS_RXF_SHIFT)
/** TX/RX Controller RX FIFO Fill-level Status - RX FIFO fill level is above the flow-control activate threshold */
#define EMAC_EMACSTATUS_RXF_FIFO_ABOVE_THRESHOLD    (0x2 << EMAC_EMACSTATUS_RXF_SHIFT)
/** TX/RX Controller RX FIFO Fill-level Status - RX FIFO Full */
#define EMAC_EMACSTATUS_RXF_FIFO_FULL   (EMAC_EMACSTATUS_RXF)
/** TX/RX Controller Read Controller State Shift */
#define EMAC_EMACSTATUS_RRC_SHIFT   (5)
/** TX/RX Controller Read Controller State */
#define EMAC_EMACSTATUS_RRC         (0x3 << EMAC_EMACSTATUS_RRC_SHIFT)
/** TX/RX Controller Read Controller State  */
#define EMAC_EMACSTATUS_RRC_IDLE    (0x0 << EMAC_EMACSTATUS_RRC_SHIFT)
/** TX/RX Controller Read Controller State  */
#define EMAC_EMACSTATUS_RRC_READ_DATA     (0x1 << EMAC_EMACSTATUS_RRC_SHIFT)
/** TX/RX Controller Read Controller State  */
#define EMAC_EMACSTATUS_RRC_READ_STATUS   (0x2 << EMAC_EMACSTATUS_RRC_SHIFT)
/** TX/RX Controller Read Controller State  */
#define EMAC_EMACSTATUS_RRC_FLUSH_DATA_AND_STATUS   (EMAC_EMACSTATUS_RRC)
/** TX/RX Controller RX FIFO Write Controller Active Status */
#define EMAC_EMACSTATUS_RWC         (1 << 4)
/** MAC Receive Frame Controller FIFO Status Shift */
#define EMAC_EMACSTATUS_RFCFC_SHIFT (1)
/** MAC Receive Frame Controller FIFO Status */
#define EMAC_EMACSTATUS_RFCFC       (0x3 << EMAC_EMACSTATUS_RFCFC_SHIFT)
/** MAC MII Receive Protocol Engine Status */
#define EMAC_EMACSTATUS_RPE         (1 << 0)
/**@}*/

/** @defgroup emac_emacrwuff_values EMAC_EMACRWUFF Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Remote Wake-Up Frame Filter Register Values
@{*/
/** Remote Wake-Up Frame Filter Mask */
#define EMAC_EMACRWUFF_WAKEUPFIL_MASK    (0xFFFFFFFF)
/** Remote Wake-Up Frame Filter */
#define EMAC_EMACRWUFF_WAKEUPFIL(x)      (x)
/**@}*/

/** @defgroup emac_emacpmtctlstat_values EMAC_EMACPMTCTLSTAT Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC PMT Control and Status Register Values
@{*/
/** Wake-Up Frame Filter Register Pointer Reset */
#define EMAC_EMACPMTCTLSTAT_WUPFRRST        (1 << 31)
/** Remote Wake-Up FIFO Pointer Shift */
#define EMAC_EMACPMTCTLSTAT_RWKPTR_SHIFT    (24)
/** Remote Wake-Up FIFO Pointer Mask */
#define EMAC_EMACPMTCTLSTAT_RWKPTR_MASK     (0x7)
/** Remote Wake-Up FIFO Pointer */
#define EMAC_EMACPMTCTLSTAT_RWKPTR(x)       (x << EMAC_EMACPMTCTLSTAT_RWKPTR_SHIFT)
/** Global Unicast */
#define EMAC_EMACPMTCTLSTAT_GLBLUCAST       (1 << 9)
/** Wake-Up Frame Received */
#define EMAC_EMACPMTCTLSTAT_WUPRX           (1 << 6)
/** Magic Packet Received */
#define EMAC_EMACPMTCTLSTAT_MGKPRX          (1 << 5)
/** Wake-Up Frame Enable */
#define EMAC_EMACPMTCTLSTAT_WUPFREN         (1 << 2)
/** Magic Packet Enable */
#define EMAC_EMACPMTCTLSTAT_MGKPKTEN        (1 << 1)
/** Power Down */
#define EMAC_EMACPMTCTLSTAT_PWRDWN          (1 << 0)
/**@}*/

/** @defgroup emac_emaclpictlstat_values EMAC_EMACLPICTLSTAT Values
 * @ingroup ethernet_registers
 * @brief LPI Control and Status Register Values
@{*/
/** LPI TX Automate */
#define EMAC_EMACLPICTLSTAT_LPITXA          (1 << 19)
/** PHY Link Status Enable */
#define EMAC_EMACLPICTLSTAT_PLSEN           (1 << 18)
/** PHY Link Status */
#define EMAC_EMACLPICTLSTAT_PLS             (1 << 17)
/** LPI Enable */
#define EMAC_EMACLPICTLSTAT_LPIEN           (1 << 16)
/** Receive LPI Mode */
#define EMAC_EMACLPICTLSTAT_RLPIST          (1 << 9)
/** Transmit LPI Mode */
#define EMAC_EMACLPICTLSTAT_TLPIST          (1 << 8)
/** Receive LPI Exit */
#define EMAC_EMACLPICTLSTAT_RLPIEX          (1 << 3)
/** Receive LPI Entry */
#define EMAC_EMACLPICTLSTAT_RLPIEN          (1 << 2)
/** Transmit LPI Exit */
#define EMAC_EMACLPICTLSTAT_TLPIEX          (1 << 1)
/** Transmit LPI Entry */
#define EMAC_EMACLPICTLSTAT_TLPIEN          (1 << 0)
/**@}*/

