Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup emac_emaclpitimerctrl_values EMAC_EMACLPITIMERCTRL Values
 * @ingroup ethernet_registers
 * @brief LPI Timers Control Register Values
@{*/
/** LPI LS Timer Shift */
#define EMAC_EMACLPITIMERCTRL_LST_SHIFT (16)
/** LPI LS Timer Mask */
#define EMAC_EMACLPITIMERCTRL_LST_MASK  (0x3FF)
/** LPI LS Timer */
#define EMAC_EMACLPITIMERCTRL_LST(x)    (x << EMAC_EMACLPITIMERCTRL_LST_SHIFT)
/** LPI TW Timer Mask */
#define EMAC_EMACLPITIMERCTRL_TWT_MASK  (0xFFFF)
/** LPI TW Timer */
#define EMAC_EMACLPITIMERCTRL_TWT(x)    (x)
/**@}*/

/** @defgroup emac_emacris_values EMAC_EMACRIS Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Raw Interrupt Status Register Values
@{*/
/** LPI Interrupt Status */
#define EMAC_EMACRIS_LPI        (1 << 10)
/** Timestamp Interrupt Status */
#define EMAC_EMACRIS_TS         (1 << 9)
/** MMC Transmit Interrupt Status */
#define EMAC_EMACRIS_MMCTX      (1 << 6)
/** MMC Receive Interrupt Status */
#define EMAC_EMACRIS_MMCRX      (1 << 5)
/** MMC Interrupt Status */
#define EMAC_EMACRIS_MMC        (1 << 4)
/** PMT Interrupt Status */
#define EMAC_EMACRIS_PMT        (1 << 3)
/**@}*/

/** @defgroup emac_emacim_values EMAC_EMACIM Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Interrupt Mask Register Values
@{*/
/** LPI Interrupt Mask */
#define EMAC_EMACIM_LPI         (1 << 10)
/** Timestamp Interrupt Mask */
#define EMAC_EMACIM_TSI         (1 << 9)
/** PMT Interrupt Mask */
#define EMAC_EMACIM_PMT         (1 << 3)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacaddrh_values EMAC_EMACADDRxH Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Address [0..3] High Register Values
@{*/
/** Address Enable */
#define EMAC_EMACADDRxH_AE               (1 << 31)
/** Source Address. Available only for EMACADDR[1..3]H. */
#define EMAC_EMACADDRxH_SA               (1 << 30)
/**  */
#define EMAC_EMACADDRxH_MBC_SHIFT        (24)
/**  */
#define EMAC_EMACADDRxH_MBC              (0x3F << EMAC_EMACADDRH_MBC_SHIFT)
/** MAC Address [47:32] */
#define EMAC_EMACADDRxH_ADDRHI           (0xFFFF)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacaddrl_values EMAC_EMACADDRL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Address [0..3] Low Register Values
@{*/
/** MAC Address [31:0] */
#define EMAC_EMACADDRxL_ADDRLO           (0xFFFFFFFF)
/** i=[0..3] */
#define EMAC_EMACADDRL(i)           MMIO32(EMAC_BASE + 0x44+(i)*8)
/**@}*/

/* TODO Вернуться сюда позже */
/* i=[0..3] */
#define EMAC_EMACADDRH(i)           MMIO32(EMAC_BASE + 0x40+(i)*8)
/* i=[0..3] */
#define EMAC_EMACADDRL(i)           MMIO32(EMAC_BASE + 0x44+(i)*8)

/** @defgroup emac_emacwdogto_values EMAC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Watchdog Time-out Register Values
@{*/
/** Programmable Watchdog Enable */
#define EMAC_EMACWDOGTO_PWE         (1 << 16)
/** Watchdog Time-out */
#define EMAC_EMACWDOGTO_WTO         (0x3FFF)
/**@}*/

/** @defgroup emac_emacmmcctrl_values EMAC_EMACMMCCTRL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MMC Control Register Values
@{*/
/** Update MMC Counters for Dropped Broadcast Frames */
#define EMAC_EMACMMCCTRL_UCDBC          (1 << 8)
/** Full/Half Preset Level Value */
#define EMAC_EMACMMCCTRL_CNTPRSTLVL     (1 << 5)
/** Counters Preset */
#define EMAC_EMACMMCCTRL_CNTPRST        (1 << 4)
/** MMC Counter Freeze */
#define EMAC_EMACMMCCTRL_CNTFREEZ       (1 << 3)
/** Reset on Read */
#define EMAC_EMACMMCCTRL_RSTONRD        (1 << 2)
/** Counters Stop Rollover */
#define EMAC_EMACMMCCTRL_CNTSTPRO       (1 << 1)
/** Counters Reset */
#define EMAC_EMACMMCCTRL_CNTRST         (1 << 0)
/**@}*/

/** @defgroup emac_emacmmcrxris_values EMAC_EMACMMCRXRIS Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MMC Receive Raw Interrupt Status Register Values
@{*/
/** MMC Receive Unicast Good Frame Counter Interrupt Status */
#define EMAC_EMACMMCRXRIS_UCGF          (1 << 17)
/** MMC Receive Alignment Error Frame Counter Interrupt Status */
#define EMAC_EMACMMCRXRIS_ALGNERR       (1 << 6)
/** MMC Receive CRC Error Frame Counter Interrupt Status */
#define EMAC_EMACMMCRXRIS_CRCERR        (1 << 5)
/** MMC Receive Good Bad Frame Counter Interrupt Status */
#define EMAC_EMACMMCRXRIS_GBF           (1 << 0)
/**@}*/

/** @defgroup emac_emacmmctxris_values EMAC_EMACMMCTXRIS Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MMC Transmit Raw Interrupt Status Register Values
@{*/
/** Octet Counter Interrupt Status */
#define EMAC_EMACMMCTXRIS_OCTCNT        (1 << 20)
/** MMC Transmit Multiple Collision Good Frame Counter Interrupt Status */
#define EMAC_EMACMMCTXRIS_MCOLLGF       (1 << 15)
/** MMC Transmit Single Collision Good Frame Counter Interrupt Status */
#define EMAC_EMACMMCTXRIS_SCOLLGF       (1 << 14)
/** MMC Transmit Good Bad Frame Counter Interrupt Status */
#define EMAC_EMACMMCTXRIS_GBF           (1 << 1)
/**@}*/

/** @defgroup emac_emacmmcrxim_values EMAC_EMACMMCRXIM Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MMC Receive Interrupt Mask Register Values
@{*/
/** MMC Receive Unicast Good Frame Counter Interrupt Mask */
#define EMAC_EMACMMCRXIM_UCGF           (1 << 17)
/** MMC Receive Alignment Error Frame Counter Interrupt Mask */
#define EMAC_EMACMMCRXIM_ALGNERR        (1 << 6)
/** MMC Receive CRC Error Frame Counter Interrupt Mask */
#define EMAC_EMACMMCRXIM_CRCERR         (1 << 5)
/** MMC Receive Good Bad Frame Counter Interrupt Mask */
#define EMAC_EMACMMCRXIM_GBF            (1 << 0)
/**@}*/

/** @defgroup emac_emacmmctxim_values EMAC_EMACMMCTXIM Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC MMC Transmit Interrupt Mask Register Values
@{*/
/** MMC Transmit Good Octet Counter Interrupt Mask */
#define EMAC_EMACMMCTXIM_OCTCNT         (1 << 20)
/** MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask */
#define EMAC_EMACMMCTXIM_MCOLLGF        (1 << 15)
/** MMC Transmit Single Collision Good Frame Counter Interrupt Mask */
#define EMAC_EMACMMCTXIM_SCOLLGF        (1 << 14)
/** MMC Transmit Good Bad Frame Counter Interrupt Mask */
#define EMAC_EMACMMCTXIM_GBF            (1 << 1)
/**@}*/

