Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup emac_emactxcntgb_values EMAC_EMACTXCNTGB Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Frame Count for Good and Bad Frames Register Values
@{*/
/** Transmit Frame Count for Good and Bad Frames */
#define EMAC_EMACTXCNTGB_TXFRMGB        (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactxcntscol_values EMAC_EMACTXCNTSCOL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Frame Count for Frames Transmitted after Single Collision Register Values
@{*/
/** Transmit Frame Count for Frames Transmitted after Single Collision */
#define EMAC_EMACTXCNTSCOL_TXSNGLCOLG   (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactxcntmcol_values EMAC_EMACTXCNTMCOL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Frame Count for Frames Transmitted after Multiple Collisions Register Values
@{*/
/** Transmit Frame Count for Frames Transmitted after Multiple Collisions */
#define EMAC_EMACTXCNTMCOL_TXMULTCOLG   (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactxoctcntg_values EMAC_EMACTXOCTCNTG Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Octet Count Good Register Values
@{*/
/** Transmit Octet Count Good */
#define EMAC_EMACTXOCTCNTG_TXOCTG       (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacrxcntgb_values EMAC_EMACRXCNTGB Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Frame Count for Good and Bad Frames Register Values
@{*/
/** Receive Frame Count for Good and Bad Frames */
#define EMAC_EMACRXCNTGB_RXFRMGB        (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacrxcntcrcerr_values EMAC_EMACRXCNTCRCERR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Frame Count for CRC Error Frames Register Values
@{*/
/** Receive Frame Count for CRC Error Frames */
#define EMAC_EMACRXCNTCRCERR_RXCRCERR   (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacrxcntalgnerr_values EMAC_EMACRXCNTALGNERR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Frame Count for Alignment Error Frames Register Values
@{*/
/** Receive Frame Count for Alignment Error Frames */
#define EMAC_EMACRXCNTALGNERR_RXALGNERR (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacrxcntguni_values EMAC_EMACRXCNTGUNI Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Frame Count for Good Unicast Frames Register Values
@{*/
/** Receive Frame Count for Good Unicast Frames */
#define EMAC_EMACRXCNTGUNI_RXUCASTG     (0xFFFFFFFF)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacvlnincrep_values EMAC_EMACVLNINCREP Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC VLAN Tag Inclusion or Replacement Register Values
@{*/
/** C-VLAN or S-VLAN */
#define EMAC_EMACVLNINCREP_CSVL         (1 << 19)
/** VLAN Priority Control */
#define EMAC_EMACVLNINCREP_VLP          (1 << 18)
/**  */
#define EMAC_EMACVLNINCREP_VLC_SHIFT    (16)
/**  */
#define EMAC_EMACVLNINCREP_VLC          (0x3 << EMAC_EMACVLNINCREP_VLC_SHIFT)
/**  */
#define EMAC_EMACVLNINCREP_VLT          (0xFFFF)
/**@}*/

/** @defgroup emac_emacvlanhash_values EMAC_EMACVLANHASH Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC VLAN Hash Table Register Values
@{*/
/** VLAN Hash Table */
#define EMAC_EMACVLANHASH_VLHT          (0xFFFF)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emactimstctrl_values EMAC_EMACTIMSTCTRL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Timestamp Control Register Values
@{*/
/** Enable MAC address for PTP Frame Filtering */
#define EMAC_EMACTIMSTCTRL_PTPFLTR      (1 << 18)
/**  */
#define EMAC_EMACTIMSTCTRL_SELPTP_SHIFT (16)
/**  */
#define EMAC_EMACTIMSTCTRL_SELPTP       (0x3 << EMAC_EMACTIMSTCTRL_SELPTP_SHIFT)
/** Enable Snapshot for Messages Relevant to Master */
#define EMAC_EMACTIMSTCTRL_TSMAST       (1 << 15)
/** Enable Timestamp Snapshot for Event Messages */
#define EMAC_EMACTIMSTCTRL_TSEVNT       (1 << 14)
/** Enable Processing of PTP Frames Sent over IPv4-UDP */
#define EMAC_EMACTIMSTCTRL_PTPIPV4      (1 << 13)
/** Enable Processing of PTP Frames Sent Over IPv6-UDP */
#define EMAC_EMACTIMSTCTRL_PTPIPV6      (1 << 12)
/** Enable Processing of PTP Over Ethernet Frames */
#define EMAC_EMACTIMSTCTRL_PTPETH       (1 << 11)
/** Enable PTP Packet Processing For Version 2 Format */
#define EMAC_EMACTIMSTCTRL_PTPVER2      (1 << 10)
/** Timestamp Digital or Binary Rollover Control */
#define EMAC_EMACTIMSTCTRL_DGTLBIN      (1 << 9)
/** Enable Timestamp For All Frames */
#define EMAC_EMACTIMSTCTRL_ALLF         (1 << 8)
/** Addend Register Update */
#define EMAC_EMACTIMSTCTRL_ADDREGUP     (1 << 5)
/** Timestamp Interrupt Trigger Enable */
#define EMAC_EMACTIMSTCTRL_INTTRIG      (1 << 4)
/** Timestamp Update */
#define EMAC_EMACTIMSTCTRL_TSUPDT       (1 << 3)
/** Timestamp Initialize */
#define EMAC_EMACTIMSTCTRL_TSINIT       (1 << 2)
/** Timestamp Fine or Coarse Update */
#define EMAC_EMACTIMSTCTRL_TSFCUPDT     (1 << 1)
/** Timestamp Enable */
#define EMAC_EMACTIMSTCTRL_TSEN         (1 << 0)
/**@}*/

/** @defgroup emac_emacsubsecinc_values EMAC_EMACSUBSECINC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Sub-Second Increment Register Values
@{*/
/** Sub-second Increment Value */
#define EMAC_EMACSUBSECINC_SSINC        (0xFF)
/**@}*/

/** @defgroup emac_emactimsec_values EMAC_EMACTIMSEC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC System Time - Seconds Register Values
@{*/
/** Timestamp Second */
#define EMAC_EMACTIMSEC_TSS             (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactimnano_values EMAC_EMACTIMNANO Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC System Time - Nanoseconds Register Values
@{*/
/** Timestamp Sub-Seconds */
#define EMAC_EMACTIMNANO_TSSS           (0x7FFFFFFF)
/**@}*/

/** @defgroup emac_emactimsecu_values EMAC_EMACTIMSECU Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC System Time - Seconds Update Register Values
@{*/
/** Timestamp Second */
#define EMAC_EMACTIMSECU_TSS            (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactimnanou_values EMAC_EMACTIMNANOU Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC System Time - Nanoseconds Update Register Values
@{*/
/** Add or subtract time */
#define EMAC_EMACTIMNANOU_ADDSUB        (1 << 31)
/** Timestamp Sub-Second */
#define EMAC_EMACTIMNANOU_TSSS          (0x7FFFFFFF)
/**@}*/

/** @defgroup emac_emactimadd_values EMAC_EMACTIMADD Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Timestamp Addend Register Values
@{*/
/** Timestamp Addend Register */
#define EMAC_EMACTIMADD_TSAR            (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactargsec_values EMAC_EMACTARGSEC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Target Time Seconds Register Values
@{*/
/** Target Time Seconds Register */
#define EMAC_EMACTARGSEC_TSTR           (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emactargnano_values EMAC_EMACTARGNANO Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Target Time Nanoseconds Register Values
@{*/
/** Target Time Register Busy */
#define EMAC_EMACTARGNANO_TRGTBUSY      (1 << 31)
/** Target Timestamp Low Register */
#define EMAC_EMACTARGNANO_TTSLO         (0x7FFFFFFF)
/**@}*/

/** @defgroup emac_emachwordsec_values EMAC_EMACHWORDSEC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC System Time-Higher Word Seconds Register Values
@{*/
/** Target Timestamp Higher Word Register */
#define EMAC_EMACHWORDSEC_TSHWR         (0xFFFF)
/**@}*/

/** @defgroup emac_emactimstat_values EMAC_EMACTIMSTAT Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Timestamp Status Register Values
@{*/
/** Timestamp Target Time Reached */
#define EMAC_EMACTIMSTAT_TSTARGT        (1 << 1)
/** Timestamp Seconds Overflow */
#define EMAC_EMACTIMSTAT_TSSOVF         (1 << 0)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacppsctrl_values EMAC_EMACPPSCTRL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC PPS Control Register Values
@{*/
/** Target Time Register Mode for PPS0 Output Shift */
#define EMAC_EMACPPSCTRL_TRGMODS0_SHIFT (5)
/** Target Time Register Mode for PPS0 Output */
#define EMAC_EMACPPSCTRL_TRGMODS0       (0x3 << EMAC_EMACPPSCTRL_TRGMODS0_SHIFT)
/** Target Time Register Mode for PPS0 Output - Interrupt Event */
#define EMAC_EMACPPSCTRL_TRGMODS0_INT (0x0 << EMAC_EMACPPSCTRL_TRGMODS0_SHIFT)
/** Target Time Register Mode for PPS0 Output - Interrupt Event and EN0PPS */
#define EMAC_EMACPPSCTRL_TRGMODS0_INT_AND_EN0PPS (0x2 << EMAC_EMACPPSCTRL_TRGMODS0_SHIFT)
/** Target Time Register Mode for PPS0 Output - EN0PPS */
#define EMAC_EMACPPSCTRL_TRGMODS0_EN0PPS (EMAC_EMACPPSCTRL_TRGMODS0)
/** Flexible PPS Output Mode Enable */
#define EMAC_EMACPPSCTRL_PPSEN0         (1 << 4)
/**  */
#define EMAC_EMACPPSCTRL_PPSCTRL        (0xF)
/**@}*/

/** @defgroup emac_emacpps0intvl_values EMAC_EMACPPS0INTVL Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC PPS0 Interval Register Values
@{*/
/** PPS0 Output Signal Interval */
#define EMAC_EMACPPS0INTVL_PPS0INT      (0xFFFFFFFF)
/**@}*/

