Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup emac_emacpps0width_values EMAC_EMACPPS0WIDTH Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC PPS0 Width Register Values
@{*/
/** EN0PPS Output Signal Width */
#define EMAC_EMACPPS0WIDTH_PPS0WIDTH    (0xFFFFFFFF)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacdmabusmod_values EMAC_EMACDMABUSMOD Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC DMA Bus Mode Register Values
@{*/
/** Rebuild Burst */
#define EMAC_EMACDMABUSMOD_RIB          (1 << 31)
/** Transmit Priority */
#define EMAC_EMACDMABUSMOD_TXPR         (1 << 27)
/** Mixed Burst */
#define EMAC_EMACDMABUSMOD_MB           (1 << 26)
/** Address Aligned Beats */
#define EMAC_EMACDMABUSMOD_AAL          (1 << 25)
/** 8 x Programmable Burst Length (PBL) Mode */
#define EMAC_EMACDMABUSMOD_8xPBL        (1 << 24)
/** Use Separate Programmable Burst Length (PBL */
#define EMAC_EMACDMABUSMOD_USP          (1 << 23)
/**  */
#define EMAC_EMACDMABUSMOD_RPBL_SHIFT   (17)
/**  */
#define EMAC_EMACDMABUSMOD_RPBL         (0x3F << EMAC_EMACDMABUSMOD_RPBL_SHIFT)
/** Fixed Burst */
#define EMAC_EMACDMABUSMOD_FB           (1 << 16)
/**  */
#define EMAC_EMACDMABUSMOD_PR_SHIFT     (14)
/**  */
#define EMAC_EMACDMABUSMOD_PR           (0x3 << EMAC_EMACDMABUSMOD_PR_SHIFT)
/**  */
#define EMAC_EMACDMABUSMOD_PR_1_1       (0x0 << EMAC_EMACDMABUSMOD_PR_SHIFT)
/**  */
#define EMAC_EMACDMABUSMOD_PR_2_1       (0x1 << EMAC_EMACDMABUSMOD_PR_SHIFT)
/**  */
#define EMAC_EMACDMABUSMOD_PR_3_1       (0x2 << EMAC_EMACDMABUSMOD_PR_SHIFT)
/**  */
#define EMAC_EMACDMABUSMOD_PR_4_1       (0x3 << EMAC_EMACDMABUSMOD_PR_SHIFT)
/**  */
#define EMAC_EMACDMABUSMOD_PBL_SHIFT    (8)
/**  */
#define EMAC_EMACDMABUSMOD_PBL          (0x3F << EMAC_EMACDMABUSMOD_PBL_SHIFT)
/** Alternate Descriptor Size */
#define EMAC_EMACDMABUSMOD_ATDS         (1 << 7)
/**  */
#define EMAC_EMACDMABUSMOD_DSL_SHIFT    (2)
/**  */
#define EMAC_EMACDMABUSMOD_DSL          (0x1F << EMAC_EMACDMABUSMOD_DSL_SHIFT)
/** DMA Arbitration Scheme */
#define EMAC_EMACDMABUSMOD_DA           (1 << 1)
/** DMA Software Reset */
#define EMAC_EMACDMABUSMOD_SWR          (1 << 0)
/**@}*/

/** @defgroup emac_emactxpolld_values EMAC_EMACTXPOLLD Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Poll Demand Register Values
@{*/
/** Transmit Poll Demand */
#define EMAC_EMACTXPOLLD_TPD            (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacrxpolld_values EMAC_EMACRXPOLLD Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Poll Demand Register Values
@{*/
/** Receive Poll Demand */
#define EMAC_EMACRXPOLLD_RPD            (0xFFFFFFFF)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacrxdladdr_values EMAC_EMACRXDLADDR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Descriptor List Address Register Values
@{*/
/**  */
#define EMAC_EMACRXDLADDR_STRXLIST_SHIFT    (2)
/** Start of Receive List */
#define EMAC_EMACRXDLADDR_STRXLIST          (0x3FFFFFFF << EMAC_EMACRXDLADDR_STRXLIST_SHIFT)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emactxdladdr_values EMAC_EMACTXDLADDR Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Transmit Descriptor List Address Register Values
@{*/
/**  */
#define EMAC_EMACTXDLADDR_TXDLADDR_SHIFT    (2)
/** Start of Transmit List Base Address */
#define EMAC_EMACTXDLADDR_TXDLADDR          (0x3FFFFFFF << EMAC_EMACTXDLADDR_TXDLADDR_SHIFT)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacdmaris_values EMAC_EMACDMARIS Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC DMA Interrupt Status Register Values
@{*/
/** Timestamp Trigger Interrupt Status */
#define EMAC_EMACDMARIS_TT              (1 << 29)
/** MAC PMT Interrupt Status */
#define EMAC_EMACDMARIS_PMT             (1 << 28)
/** MAC MMC Interrupt */
#define EMAC_EMACDMARIS_MMC             (1 << 27)
/**  */
#define EMAC_EMACDMARIS_AE_SHIFT        (23)
/**  */
#define EMAC_EMACDMARIS_AE              (0x7 << EMAC_EMACDMARIS_AE_SHIFT)
/**  */
#define EMAC_EMACDMARIS_TS_SHIFT        (20)
/**  */
#define EMAC_EMACDMARIS_TS              (0x7 << EMAC_EMACDMARIS_TS_SHIFT)
/**  */
#define EMAC_EMACDMARIS_RS_SHIFT        (17)
/**  */
#define EMAC_EMACDMARIS_RS              (0x7 << EMAC_EMACDMARIS_RS_SHIFT)
/** Normal Interrupt Summary */
#define EMAC_EMACDMARIS_NIS             (1 << 16)
/** Abnormal Interrupt Summary */
#define EMAC_EMACDMARIS_AIS             (1 << 15)
/** Early Receive Interrupt */
#define EMAC_EMACDMARIS_ERI             (1 << 14)
/** Fatal Bus Error Interrupt */
#define EMAC_EMACDMARIS_FBI             (1 << 13)
/** Early Transmit Interrupt */
#define EMAC_EMACDMARIS_ETI             (1 << 10)
/** Receive Watchdog Time-out */
#define EMAC_EMACDMARIS_RWT             (1 << 9)
/** Receive Process Stopped */
#define EMAC_EMACDMARIS_RPS             (1 << 8)
/** Receive Buffer Unavailable */
#define EMAC_EMACDMARIS_RU              (1 << 7)
/** Receive Interrupt */
#define EMAC_EMACDMARIS_RI              (1 << 6)
/** Transmit Underflow */
#define EMAC_EMACDMARIS_UNF             (1 << 5)
/** Receive Overflow */
#define EMAC_EMACDMARIS_OVF             (1 << 4)
/** Transmit Jabber Time-out */
#define EMAC_EMACDMARIS_TJT             (1 << 3)
/** Transmit Buffer Unavailable */
#define EMAC_EMACDMARIS_TU              (1 << 2)
/** Transmit Process Stopped */
#define EMAC_EMACDMARIS_TPS             (1 << 1)
/** Transmit Interrupt */
#define EMAC_EMACDMARIS_TI              (1 << 0)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacdmaopmode_values EMAC_EMACDMAOPMODE Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC DMA Operation Mode Register Values
@{*/
/** Disable Dropping of TCP/IP Checksum Error Frames */
#define EMAC_EMACDMAOPMODE_DT           (1 << 26)
/** Receive Store and Forward */
#define EMAC_EMACDMAOPMODE_RSF          (1 << 25)
/** Disable Flushing of Received Frames */
#define EMAC_EMACDMAOPMODE_DFF          (1 << 24)
/** Transmit Store and Forward */
#define EMAC_EMACDMAOPMODE_TSF          (1 << 21)
/** Flush Transmit FIFO */
#define EMAC_EMACDMAOPMODE_FTF          (1 << 20)
/**  */
#define EMAC_EMACDMAOPMODE_TTC_SHIFT    (1 << 14)
/**  */
#define EMAC_EMACDMAOPMODE_TTC          (0x7 << EMAC_EMACDMAOPMODE_TTC_SHIFT)
/** Start or Stop Transmission Command */
#define EMAC_EMACDMAOPMODE_ST           (1 << 13)
/** Forward Error Frames */
#define EMAC_EMACDMAOPMODE_FEF          (1 << 7)
/** Forward Undersized Good Frames */
#define EMAC_EMACDMAOPMODE_FUF          (1 << 6)
/** Drop Giant Frame Enable */
#define EMAC_EMACDMAOPMODE_DGF          (1 << 5)
/**  */
#define EMAC_EMACDMAOPMODE_RTC_SHIFT    (3)
/**  */
#define EMAC_EMACDMAOPMODE_RTC          (0x3 << EMAC_EMACDMAOPMODE_RTC_SHIFT)
/** Operate on Second Frame */
#define EMAC_EMACDMAOPMODE_OSF          (1 << 2)
/** Start or Stop Receive */
#define EMAC_EMACDMAOPMODE_SR           (1 << 1)
/**@}*/

/** @defgroup emac_emacdmaim_values EMAC_EMACDMAIM Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC DMA Interrupt Mask Register Values
@{*/
/** Normal Interrupt Summary Enable */
#define EMAC_EMACDMAIM_NIE              (1 << 16)
/** Abnormal Interrupt Summary Enable */
#define EMAC_EMACDMAIM_AIE              (1 << 15)
/** Early Receive Interrupt Enable */
#define EMAC_EMACDMAIM_ERE              (1 << 14)
/** Fatal Bus Error Enable */
#define EMAC_EMACDMAIM_FBE              (1 << 13)
/** Early Transmit Interrupt Enable */
#define EMAC_EMACDMAIM_ETE              (1 << 10)
/** Receive Watchdog Time-out Enable */
#define EMAC_EMACDMAIM_RWE              (1 << 9)
/** Receive Stopped Enable */
#define EMAC_EMACDMAIM_RSE              (1 << 8)
/** Receive Buffer Unavailable Enable */
#define EMAC_EMACDMAIM_RUE              (1 << 7)
/** Receive Interrupt Enable */
#define EMAC_EMACDMAIM_RIE              (1 << 6)
/** Underflow Interrupt Enable */
#define EMAC_EMACDMAIM_UNE              (1 << 5)
/** Overflow Interrupt Enable */
#define EMAC_EMACDMAIM_OVE              (1 << 4)
/** Transmit Jabber Time-out Enable */
#define EMAC_EMACDMAIM_TJE              (1 << 3)
/** Transmit Buffer Unvailable Enable */
#define EMAC_EMACDMAIM_TUE              (1 << 2)
/** Transmit Stopped Enable */
#define EMAC_EMACDMAIM_TSE              (1 << 1)
/** Transmit Interrupt Enable */
#define EMAC_EMACDMAIM_TIE              (1 << 0)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacmfboc_values EMAC_EMACMFBOC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Missed Frame and Buffer Overflow Counter Register Values
@{*/
/** Overflow Bit for FIFO Overflow Counter */
#define EMAC_EMACMFBOC_OVFCNTOVF        (1 << 28)
/**  */
#define EMAC_EMACMFBOC_OVFFRMCNT_SHIFT  (17)
/**  */
#define EMAC_EMACMFBOC_OVFFRMCNT        (0x7FF << EMAC_EMACMFBOC_OVFFRMCNT_SHIFT)
/** Overflow bit for Missed Frame Counter */
#define EMAC_EMACMFBOC_MISCNTOVF        (1 << 16)
/**  */
#define EMAC_EMACMFBOC_MISFRMCNT        (0xFFFF)
/**@}*/

