Misaka0x2730/libopencm3/include/libopencm3/ethernet/mac_msp432e4xx.h
/** @defgroup emac_emacrxintwdt_values EMAC_EMACRXINTWDT Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Receive Interrupt Watchdog Timer Register Values
@{*/
/** Receive Interrupt Watchdog Timer Count */
#define EMAC_EMACRXINTWDT_RIWT          (0xFF)
/**@}*/

/** @defgroup emac_emachostxdesc_values EMAC_EMACHOSTXDESC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Current Host Transmit Descriptor Register Values
@{*/
/** Host Transmit Descriptor Address Pointer */
#define EMAC_EMACHOSTXDESC_CURTXDESC    (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emachosrxdesc_values EMAC_EMACHOSRXDESC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Current Host Receive Descriptor Register Values
@{*/
/** Host Receive Descriptor Address Pointer */
#define EMAC_EMACHOSRXDESC_CURRXDESC    (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emachostxba_values EMAC_EMACHOSTXBA Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Current Host Transmit Buffer Address Register Values
@{*/
/** Host Transmit Buffer Address Pointer */
#define EMAC_EMACHOSTXBA_CURTXBUFA      (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emachosrxba_values EMAC_EMACHOSRXBA Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Current Host Receive Buffer Address Register Values
@{*/
/** Host Receive Buffer Address Pointer */
#define EMAC_EMACHOSRXBA_CURRXBUFA      (0xFFFFFFFF)
/**@}*/

/** @defgroup emac_emacpp_values EMAC_EMACPP Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Peripheral Property Register Register Values
@{*/
/** Ethernet MAC Type Shift */
#define EMAC_EMACPP_MACTYPE_SHIFT       (8)
/** Ethernet MAC Type */
#define EMAC_EMACPP_MACTYPE             (0x7 << EMAC_EMACPP_MACTYPE_SHIFT)
/** Ethernet MAC Type - MSP432E4 class MAC */
#define EMAC_EMACPP_MACTYPE_MSP432E4    (0x1 << EMAC_EMACPP_MACTYPE_SHIFT)
/** Ethernet PHY Type */
#define EMAC_EMACPP_PHYTYPE             (0x7)
/** Ethernet PHY Type - MSP432E4 class PHY */
#define EMAC_EMACPP_PHYTYPE_MSP432E4    (0x3)
/**@}*/

/* TODO Вернуться сюда позже */
/** @defgroup emac_emacpc_values EMAC_EMACPC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Peripheral Configuration Register Values
@{*/
/** PHY Select */
#define EMAC_EMACPC_PHYEXT              (1 << 31)
/** Ethernet Interface Select Shift */
#define EMAC_EMACPC_PINTFS_SHIFT        (28)
/** Ethernet Interface Select */
#define EMAC_EMACPC_PINTFS              (0x7 << EMAC_EMACPC_PINTFS_SHIFT)
/** Ethernet Interface Select - MII */
#define EMAC_EMACPC_PINTFS_MII          (0x0 << EMAC_EMACPC_PINTFS_SHIFT)
/** Ethernet Interface Select - RMII */
#define EMAC_EMACPC_PINTFS_RMII         (0x4 << EMAC_EMACPC_PINTFS_SHIFT)
/** PHY Soft Restart */
#define EMAC_EMACPC_DIGRESTART          (1 << 25)
/** Odd Nibble TXER Detection Disable */
#define EMAC_EMACPC_NIBDETDIS           (1 << 24)
/** RXER Detection During Idle */
#define EMAC_EMACPC_RXERIDLE            (1 << 23)
/** Isolate MII in Link Loss */
#define EMAC_EMACPC_ISOMIILL            (1 << 22)
/** Link Loss Recovery */
#define EMAC_EMACPC_LRR                 (1 << 21)
/** TDR Auto Run */
#define EMAC_EMACPC_TDRRUN              (1 << 20)
/**  */
#define EMAC_EMACPC_FASTLDMODE_SHIFT    (15)
/**  */
#define EMAC_EMACPC_FASTLDMODE          (0x1F)
/** Polarity Swap */
#define EMAC_EMACPC_POLSWAP             (1 << 14)
/** MDI Swap */
#define EMAC_EMACPC_MDISWAP             (1 << 13)
/** Robust Auto MDI-X */
#define EMAC_EMACPC_RBSTMDIX            (1 << 12)
/** Fast Auto MDI-X */
#define EMAC_EMACPC_FASTMDIX            (1 << 11)
/** MDIX Enable */
#define EMAC_EMACPC_MDIXEN              (1 << 10)
/** Fast RXDV Detection */
#define EMAC_EMACPC_FASTRXDV            (1 << 9)
/** FAST Link-Up in Parallel Detect */
#define EMAC_EMACPC_FASTLUPD            (1 << 8)
/** Extended Full Duplex Ability */
#define EMAC_EMACPC_EXTFD               (1 << 7)
/** Fast Auto Negotiation Enable */
#define EMAC_EMACPC_FASTANEN            (1 << 6)
/**  */
#define EMAC_EMACPC_FASTANSEL_SHIFT     (4)
/**  */
#define EMAC_EMACPC_FASTANSEL           (0x3 << EMAC_EMACPC_FASTANSEL_SHIFT)
/** Auto-Negotiation Enable */
#define EMAC_EMACPC_ANEN                (1 << 3)
/**  */
#define EMAC_EMACPC_ANMODE_SHIFT        (1)
/**  */
#define EMAC_EMACPC_ANMODE              (0x3 << EMAC_EMACPC_ANMODE_SHIFT)
/** Ethernet PHY Hold */
#define EMAC_EMACPC_PHYHOLD             (1 << 0)
/**@}*/

/** @defgroup emac_emaccc_values EMAC_EMACCC Values
 * @ingroup ethernet_registers
 * @brief Ethernet MAC Clock Configuration Register Values
@{*/
/** PTP Clock Reference Enable */
#define EMAC_EMACCC_PTPCEN              (1 << 18)
/** LED Polarity Control */
#define EMAC_EMACCC_POL                 (1 << 17)
/** EN0RREF_CLK Signal Enable */
#define EMAC_EMACCC_CLKEN               (1 << 16)
/**@}*/

/** @defgroup emac_ephyris_values EMAC_EPHYRIS Values
 * @ingroup ethernet_registers
 * @brief Ethernet PHY Raw Interrupt Status Register Values
@{*/
/** Ethernet PHY Raw Interrupt Status */
#define EMAC_EPHYRIS_INT                (1 << 0)
/**@}*/

/** @defgroup emac_ephyim_values EMAC_EPHYIM Values
 * @ingroup ethernet_registers
 * @brief Ethernet PHY Interrupt Mask Register Values
@{*/
/** Ethernet PHY Interrupt Mask */
#define EMAC_EPHYIM_INT                 (1 << 0)
/**@}*/

/** @defgroup emac_ephymisc_values EMAC_EPHYMISC Values
 * @ingroup ethernet_registers
 * @brief Ethernet PHY Masked Interrupt Status and Clear Register Values
@{*/
/** Ethernet PHY Status and Clear register */
#define EMAC_EPHYMISC_INT               (1 << 0)
/**@}*/

/** @defgroup ethernet_descriptors Ethernet Descriptors
 * @ingroup ethernet_defines
 * @brief Ethernet Descriptors
@{*/
/** Ethernet Descriptor n */
#define ETH_DES(n, base)        MMIO32((base) + (n)*4)
/** Ethernet Descriptor 0 */
#define ETH_DES0(base)          ETH_DES(0, base)
/** Ethernet Descriptor 1 */
#define ETH_DES1(base)          ETH_DES(1, base)
/** Ethernet Descriptor 2 */
#define ETH_DES2(base)          ETH_DES(2, base)
/** Ethernet Descriptor 3 */
#define ETH_DES3(base)          ETH_DES(3, base)
/** Ethernet Extended Descriptor 4 */
#define ETH_DES4(base)          ETH_DES(4, base)
/** Ethernet Extended Descriptor 5 */
#define ETH_DES5(base)          ETH_DES(5, base)
/** Ethernet Extended Descriptor 6 */
#define ETH_DES6(base)          ETH_DES(6, base)
/** Ethernet Extended Descriptor 7 */
#define ETH_DES7(base)          ETH_DES(7, base)
/**@}*/

/** @defgroup ethernet_descriptor_sizes Ethernet Descriptor Sizes
 * @ingroup ethernet_descriptors
 * @brief Ethernet Descriptor Sizes
@{*/
#define ETH_DES_STD_SIZE        16
#define ETH_DES_EXT_SIZE        32
/**@}*/

/** @defgroup eth_tdes0 ETH_TDES0 Values
 * @ingroup ethernet_descriptors
 * @brief Ethernet TX Descriptor 0 Values
@{*/
/** Deferred Bit */
#define ETH_TDES0_DB            (1 << 0)
/** Underflow Error */
#define ETH_TDES0_UF            (1 << 1)
/** Excessive Deferral */
#define ETH_TDES0_ED            (1 << 2)
/** Collision Count Shift */
#define ETH_TDES0_CC_SHIFT      (3)
/** Collision Count */
#define ETH_TDES0_CC            (0xF << ETH_TDES0_CC_SHIFT)
/** VLAN Frame */
#define ETH_TDES0_VF            (1 << 7)
/** Excessive Collision */
#define ETH_TDES0_EC            (1 << 8)
/** Late Collision */
#define ETH_TDES0_LCO           (1 << 9)
/** No Carrier */
#define ETH_TDES0_NC            (1 << 10)
/** Loss of Carrier */
#define ETH_TDES0_LCA           (1 << 11)
/** IP Payload Error */
#define ETH_TDES0_IPE           (1 << 12)
/** Frame Flushed */
#define ETH_TDES0_FF            (1 << 13)
/** Jabber Timeout */
#define ETH_TDES0_JT            (1 << 14)
/** Error Summary */
#define ETH_TDES0_ES            (1 << 15)
/** IP Header Error */
#define ETH_TDES0_IHE           (1 << 16)
/** TX Timestamp */
#define ETH_TDES0_TTSS          (1 << 17)
/** Second Address Chained */
#define ETH_TDES0_TCH           (1 << 20)
/** Transmit End of Ring */
#define ETH_TDES0_TER           (1 << 21)
/**  */
#define ETH_TDES0_CIC_SHIFT     (22)
/**  */
#define ETH_TDES0_CIC           (0x3 << ETH_TDES0_CIC_SHIFT)
/**  */
#define ETH_TDES0_CIC_DISABLED  (0x0 << ETH_TDES0_CIC_SHIFT)
/**  */
#define ETH_TDES0_CIC_IP        (0x1 << ETH_TDES0_CIC_SHIFT)
/**  */
#define ETH_TDES0_CIC_IPPL      (0x2 << ETH_TDES0_CIC_SHIFT)
/**  */
#define ETH_TDES0_CIC_IPPLPH    (0x3 << ETH_TDES0_CIC_SHIFT)
/** Transmit Timestamp Enable */
#define ETH_TDES0_TTSE          (1 << 25)
/** Disable Padding */
#define ETH_TDES0_DP            (1 << 26)
/** Disable CRC */
#define ETH_TDES0_DC            (1 << 27)
/** First Segment */
#define ETH_TDES0_FS            (1 << 28)
/** Last Segment */
#define ETH_TDES0_LS            (1 << 29)
/** Interrupt on Completion */
#define ETH_TDES0_IC            (1 << 30)
/** Own Bit */
#define ETH_TDES0_OWN           (1 << 31)
/**@}*/

/** @defgroup eth_tdes1 ETH_TDES1 Values
 * @ingroup ethernet_descriptors
 * @brief Ethernet TX Descriptor 1 Values
@{*/
/**  */
#define ETH_TDES1_TBS1_SHIFT    (0)
/**  */
#define ETH_TDES1_TBS1          (0x1FFF << ETH_TDES1_TBS1_SHIFT)
/**  */
#define ETH_TDES1_TBS2_SHIFT    (16)
/**  */
#define ETH_TDES1_TBS2          (0x1FFF << ETH_TDES1_TBS1_SHIFT)
/**@}*/

/** @defgroup eth_rdes0 ETH_RDES0 Values
 * @ingroup ethernet_descriptors
 * @brief Ethernet RX Descriptor 0 Values
@{*/
/**  */
#define ETH_RDES0_PCE           (1 << 0)
/**  */
#define ETH_RDES0_ESA           (1 << 0)
/**  */
#define ETH_RDES0_CE            (1 << 1)
/**  */
#define ETH_RDES0_DE            (1 << 2)
/**  */
#define ETH_RDES0_RE            (1 << 3)
/**  */
#define ETH_RDES0_RWT           (1 << 4)
/**  */
#define ETH_RDES0_FT            (1 << 5)
/**  */
#define ETH_RDES0_LCO           (1 << 6)
/**  */
#define ETH_RDES0_IPHCE         (1 << 7)
/**  */
#define ETH_RDES0_TSV           (1 << 7)
/**  */
#define ETH_RDES0_LS            (1 << 8)
/**  */
#define ETH_RDES0_FS            (1 << 9)
/**  */
#define ETH_RDES0_VLAN          (1 << 10)
/**  */
#define ETH_RDES0_OE            (1 << 11)
/**  */
#define ETH_RDES0_LE            (1 << 12)
/**  */
#define ETH_RDES0_SAF           (1 << 13)
/**  */
#define ETH_RDES0_DCE           (1 << 14)
/**  */
#define ETH_RDES0_ES            (1 << 15)
/**  */
#define ETH_RDES0_FL_SHIFT      (16)
/**  */
#define ETH_RDES0_FL            (0x3FFF << ETH_RDES0_FL_SHIFT)
/**  */
#define ETH_RDES0_AFM           (1 << 30)
/**  */
#define ETH_RDES0_OWN           (1 << 31)
/**@}*/

/** @defgroup eth_rdes1 ETH_RDES1 Values
 * @ingroup ethernet_descriptors
 * @brief Ethernet RX Descriptor 1 Values
@{*/
/**  */
#define ETH_RDES1_RBS1_SHIFT    (0)
/**  */
#define ETH_RDES1_RBS1          (0x1FFF << ETH_RDES1_RBS1_SHIFT)
/**  */
#define ETH_RDES1_RCH           (1 << 14)
/**  */
#define ETH_RDES1_RER           (1 << 15)
/**  */
#define ETH_RDES1_RBS2_SHIFT    (16)
/**  */
#define ETH_RDES1_RBS2          (0x1FFF << ETH_RDES1_RBS2_SHIFT)
/**  */
#define ETH_RDES1_DIC           (1 << 31)
/**@}*/

/** @defgroup eth_rdes4 ETH_RDES4 Values
 * @ingroup ethernet_descriptors
 * @brief Ethernet RX Descriptor 4 Values
@{*/
/**  */
#define ETH_RDES4_IPPT_SHIFT    (0)
/**  */
#define ETH_RDES4_IPPT          (0x7 << ETH_RDES4_IPPT_SHIFT)
/**  */
#define ETH_RDES4_IPPT_UNKNOWN  (0x0 << ETH_RDES4_IPPT_SHIFT)
/**  */
#define ETH_RDES4_IPPT_UDP      (0x1 << ETH_RDES4_IPPT_SHIFT)
/**  */
#define ETH_RDES4_IPPT_TCP      (0x2 << ETH_RDES4_IPPT_SHIFT)
/**  */
#define ETH_RDES4_IPPT_ICMP     (0x3 << ETH_RDES4_IPPT_SHIFT)
/**  */
#define ETH_RDES4_IPHE          (1 << 3)
/**  */
#define ETH_RDES4_IPPE          (1 << 4)
/**  */
#define ETH_RDES4_IPCB          (1 << 5)
/**  */
#define ETH_RDES4_IPV4PR        (1 << 6)
/**  */
#define ETH_RDES4_IPV6PR        (1 << 7)
/**  */
#define ETH_RDES4_PMT_SHIFT         (8)
/**  */
#define ETH_RDES4_PMT               (0x0F << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_NO            (0x00 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_SYNC          (0x01 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_FOLLOW        (0x02 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_DLYRQ         (0x03 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_DLYRSP        (0x04 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_PDLYRQ        (0x05 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_PDLYRSP       (0x06 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PMT_PDLYRSPFUP    (0x07 << ETH_RDES4_PMT_SHIFT)
/**  */
#define ETH_RDES4_PFT               (1 << 12)
/**  */
#define ETH_RDES4_PV                (1 << 13)
/**@}*/

enum eth_clk {
    ETH_CLK_020_035MHZ = EMAC_EMACMIIADDR_CR_SYSCLK_DIV_16,
    ETH_CLK_035_060MHZ = EMAC_EMACMIIADDR_CR_SYSCLK_DIV_26,
    ETH_CLK_060_100MHZ = EMAC_EMACMIIADDR_CR_SYSCLK_DIV_42,
    ETH_CLK_100_150MHZ = EMAC_EMACMIIADDR_CR_SYSCLK_DIV_62,
};

BEGIN_DECLS

void eth_smi_write(uint8_t phy, uint8_t reg, uint16_t data);
uint16_t eth_smi_read(uint8_t phy, uint8_t reg);
void eth_smi_bit_op(uint8_t phy, uint8_t reg, uint16_t bits, uint16_t mask);
void eth_smi_bit_clear(uint8_t phy, uint8_t reg, uint16_t clearbits);
void eth_smi_bit_set(uint8_t phy, uint8_t reg, uint16_t setbits);

void eth_set_mac(const uint8_t *mac);
void eth_desc_init(uint8_t *buf, uint32_t nTx, uint32_t nRx, uint32_t cTx,
                   uint32_t cRx, bool isext);
bool eth_tx(uint8_t *ppkt, uint32_t n);
bool eth_rx(uint8_t *ppkt, uint32_t *len, uint32_t maxlen);

void eth_init(uint8_t phy, enum eth_clk clock);
void eth_start(void);

void eth_enable_checksum_offload(void);

void eth_irq_enable(uint32_t reason);
void eth_irq_disable(uint32_t reason);
bool eth_irq_is_pending(uint32_t reason);
bool eth_irq_ack_pending(uint32_t reason);

END_DECLS

#endif
